"use strict"

alert('Це гра, де потрібно вгадати число від 1 до 100')

let readyToPlay = confirm("Готові почати гру?");

// Перевіряємо відповідь користувача
if (readyToPlay) {
    // Якщо користувач готовий, запитуємо його ім'я
    let userName = prompt("Як вас звати?");

    // Привітання гравця
    alert(`Привіт, ${userName}! Давайте почнемо гру!`);
} else {
    // Якщо користувач не готовий, виводимо повідомлення про відмову
    alert("Шкода, що ви вирішили не грати. Можливо, наступного разу!");
}

const randomNumber = Math.floor(Math.random() * 10) + 1;
const guess = (prompt("Спробуйте вгадати число від 1 до 100"));

// Перевіряємо, чи вгадав користувач число
if (guess === randomNumber) {
    alert(`Вітаю! Ви вгадали число ${randomNumber}!`);
} else {
    alert(`На жаль, ви не вгадали. Правильне число було: ${randomNumber}`);
}

alert ('Дякую за гру!')



